import random

# Task 1 В змінній min лежит число от 0 до 59, згенероване випадковим чином.
# Визначте в якій четверті години попадає це число (в першій, другій, третій чи четвертій).

min = random.randint(0, 59)

if min <= 14:
    print("Перша чверть")

if  min >= 15 and min <= 29 :
    print("Друга чверть")
if min >= 30 and min <= 44:
    print("Третя чверть")

if min >= 45 and min <= 59:
    print("Четверта чверть")

# Task 2
"""
В змінній birth_month запишіть номер місяця вашого народження (дані введіть з консолі). 
В залежності від введених даних виведіть характеристику для відповідної пори року:
Зима - За вікном падав сніг.
Весна - Все довкола розцвітало.
Літо - Діти насолоджувались літніми канікулами.
Осінь - Все довкола загоралось яскравими фарбами.
* Опрацюйте ситуацію коли користувач намагається ввести невірні дані і виведіть йому повідомлення у випадку
 некоректних даних. Намалюйте блок-схему до даної задачі і прикріпіть зображення до домашнього завдання.
"""

# birth_month = int(input('Enter your birth month: '))
winter = [1, 2, 12]
spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]


while True:
    birth_month = int(input('Enter your birth month: '))

    if birth_month in winter:
        print('Зима - За вікном падав сніг.')
        break

    elif birth_month in spring:
         print('Весна - Все довкола розцвітало.')
         break

    elif birth_month in summer:
        print('Літо - Діти насолоджувались літніми канікулами')
        break

    elif birth_month in autumn:
        print('Осінь - Все довкола загоралось яскравими фарбами.')
        break

    else:
        print('Такого місяця не існує')

# Task 3
"""
Число ділиться на 6 тільки в випадку виконання двох умов: остання цифра парна, а сума всіх цифр ділиться на 3. 
Рандомним чином згенеруйте будь-яке ціле число і перевірте чи воно ділиться на 6. 
В випадку позитивного результату виведіть повідомлення “Число х ділиться на 6” 
або у випадку негативної “Число х не ділиться на 6” відповідно. 
( тут не хочется бачити n%6 == 0, основне - знайти суму всіх цифр і перевірити чи вона кратна 3)
"""

x = random.randint(1, 100)


digits_sum = sum(int(digit) for digit in str(x))

if x % 10 % 2 == 0 and digits_sum % 3 == 0:
    print(f"Число {x} ділиться на 6")
else:
    print(f"Число {x} не ділиться на 6")